# 지료구조
#--------------------------------------------------------------------
# Topic2 : 트리 Key-Value
#--------------------------------------------------------------------
"""
# Chapter1 : 트리 - 계층적 관계
	트리 구조의 이해.

# Chapter2 : 힙 트리
	- 힙은 완전 이진 트리
	- 모든 부모 노드의 데이터는 자식 노드들의 데이터보다 크거나 같다.
	- 힘 생성 O(n*lg(n)), 힙 정렬 O(n*lg(n))

	정렬 알고리즘	시간 복잡도
	선택 정렬		O(n^2)
	삽입 정렬		O(n^2)
	합병 정렬		O(nlg(n))
	퀵 정렬		평균 O(nlg(n) 최악 O(n^2)
	힙 정렬		O(nlg(n))

						데이터 삽입		데이터 추출
	정렬된 동적 배열			O(n)		O(1)
	정렬된 더블리 링크드 리스트	O(n)		O(1)
	힙					O(lg(n))	O(lg(n))

# Chapter3 : 이진 탐색 트리
	- 부모 노드 보다 작은 값 왼쪽, 큰값 오른쪽 으로 구성.
	- 삽입/삭제 모두 O(h) - h는 트리는 깊이값.

		이진 탐색 트리							해시 테이블
	삽입	O(h) (평균적 O(lg(n)), 최악 O(n)O(n))	평균적 O(1), 최악 O(n)
	탐색	O(h) (평균적 O(lg(n)), 최악 O(n)O(n))	평균적 O(1), 최악 O(n)
	삭제	O(h) (평균적 O(lg(n)), 최악 O(n)O(n))	평균적 O(1), 최악 O(n)

"""